Hi @tfeltin -- I just tried to replicate and with a very simple configuration this works for me.  Now, I did not use any templating and I do not know what your tpl / resulting YAML looks like.  But can I ask you to use a plain topology file that you've exported from CML and see if that works to narrow this down?

```plain
Terraform will perform the following actions:

  # cml2_lifecycle.top will be created
  + resource "cml2_lifecycle" "top" {
      + booted   = (known after apply)
      + id       = (known after apply)
      + lab_id   = (known after apply)
      + nodes    = (known after apply)
      + state    = "STARTED"
      + topology = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
cml2_lifecycle.top: Creating...
cml2_lifecycle.top: Still creating... [10s elapsed]
cml2_lifecycle.top: Creation complete after 10s [id=e2d33abe-a105-4675-98ca-1f7943022374]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

~/tf-demo-2 via 💠 default on   (us-east-1) took 10s 
❯ 
```